# Introduction To Python For Data Analysis Week 3 Homework

## Instructions
In the cell below please complete the function.  The function takes two arguments.  The first argument is a the names dataframe that we have used in class, the second argument is _name_.  The function should return a new dataframe that only contains the rows where the 'Name' column equals the _name_ argument.

You normally would not wrap this code inside a function - it is too simple to put inside a function, but putting the code inside a functions assists the grader.

In [28]:
def returnDataForOneName(namesDF, name):
    '''
    Please return from this function the rows from namesDF where the 'Name'
    column is equal to the name argument that is passed to this function.
    
    REMOVE the line "raise NotImplementedError()". This is how I know you have
    edited this at all.
    
    Again - be sure to REMOVE the line "raise NotImplementedError()"
    '''
    #create boolean that checks which
    isName = namesDF.loc[:,'Name']==name 
    output= namesDF.loc[isName]
    
    return  output

## Test your function in the cell below:

In [49]:
import pandas as pd
name_data_path = '/Users/16614/Desktop/PYT303/Week 2/Most_Popular_Baby_Boy_Names__Illinois_1980-2013.csv' # change this to the path of the name data file on your computer
# Now load the data:
nameDF = pd.read_csv(name_data_path) 
newDF = returnDataForOneName(nameDF, 'Anthony')

# Now use some of the methods we have used to explore dataframes (like .head)
# to see if newDF only contains rows where "Name" equals 'Michael'. Then 
# change the name you are passing to the function and try again - this function
# must work for other names, not just 'Michael'.

In [50]:
#check if only the name in parameter is printing

newDF['Name'].unique()

array(['Anthony'], dtype=object)

In [51]:
#pull top 5 from new df

newDF.head()

     Rank  Year     Name  Frequency
18     19  1980  Anthony       1126
42     18  1981  Anthony       1164
67     18  1982  Anthony       1134
90     16  1983  Anthony       1213
116    17  1984  Anthony       1201

In [52]:
#pull bottom 5 from new df

newDF.tail()

     Rank  Year     Name  Frequency
531     7  2001  Anthony       1033
556     7  2002  Anthony        999
579     5  2003  Anthony       1078
603     4  2004  Anthony       1058
632     8  2005  Anthony        937

In [53]:
#get the number of occurences of the name in the data

newDF.count()

Rank         26
Year         26
Name         26
Frequency    26
dtype: int64

In [54]:
#describe the data wit

newDF.describe()

            Rank         Year    Frequency
count  26.000000    26.000000    26.000000
mean   13.230769  1992.500000  1130.115385
std     4.226655     7.648529   113.513110
min     4.000000  1980.000000   937.000000
25%    11.250000  1986.250000  1032.250000
50%    14.000000  1992.500000  1130.000000
75%    16.000000  1998.750000  1219.750000
max    19.000000  2005.000000  1335.000000